Update 02_overall_design.md
